import React from 'react';
import { FaBalanceScale, FaChild, FaHandshake, FaFileAlt, FaMoneyBillWave, FaGavel } from 'react-icons/fa';
import "./services.css";

const Services: React.FC = () => {

  const images = [
    '/home.png',
    '/home.png',
    '/home.png',
    '/home.png',
  ];

  // Auto slide functionality
 
  return (
    <div className="services-container">
    

      {/* Expertise Section */}
      <div className="expertise-title">
        <h2>תחומי ההתמחות שלי</h2>
      </div>
      <section className="expertise-section">
  {[
    {
      title: "גישור ויישוב סכסוכים במשפחה",
      description:
        "במסגרת תהליכי גישור ויישוב סכסוכים משפחתיים, אנו מציעים ליווי מקצועי ורגיש שמטרתו לסייע לצדדים המעורבים להגיע להסכמות בדרכי שלום, תוך הימנעות ממאבקים משפטיים מורכבים ויקרים. תהליך הגישור מותאם לצרכים הייחודיים של כל משפחה, ונועד לשמור על כבוד הדדי ויחסים טובים בין בני המשפחה, גם במצבים מורכבים של גירושין, חלוקת רכוש או משמורת ילדים. המטרה המרכזית של הגישור היא לייצר פתרון בר-קיימא המשקף את האינטרסים של כל הצדדים, ומאפשר למשפחה להמשיך הלאה בצורה מאוזנת ושקולה. בנוסף, הליך הגישור מציע סביבה דיסקרטית ונעימה המאפשרת דיון פתוח וממוקד, ללא לחצים חיצוניים.",
      image:"/family.jpg",
      
    },
    {
      title: "עריכת הסכמי ממון וגירושין",
      description:
        "עריכת הסכמי ממון וגירושין היא צעד חיוני שמסייע לשמור על הסדר והבהירות בנושאים כלכליים ומשפחתיים. הסכמי ממון, הנערכים בדרך כלל לפני הנישואין, מיועדים להגן על נכסים קיימים ולהסדיר את האופן שבו יחולקו הנכסים בעתיד. הסכמי גירושין, לעומת זאת, מתמקדים בנושאים כמו חלוקת רכוש, קביעת משמורת ילדים, זמני שהות, ותשלומי מזונות. תהליך זה מתבצע תוך מתן דגש על הוגנות, שקיפות, והתאמה אישית לצרכים של כל צד. עורכת דין המתמחה בתחום דיני המשפחה מלווה את התהליך משלב המשא ומתן ועד לחתימה הסופית, ומבטיחה שכל ההיבטים המשפטיים מוסדרים כראוי כדי למנוע מחלוקות עתידיות ולשמור על זכויותיכם. בעזרת הסכמים ברורים ומפורטים, ניתן להבטיח יציבות ושקט נפשי לכל הצדדים המעורבים.",
      image:"/divorce.png",

    },
    {
      title: "משמורת ילדים והסדרי ראייה",
      description:
        "משמורת ילדים והסדרי ראייה הם מהנושאים המורכבים ביותר בדיני משפחה, שכן מדובר בעתידם ורווחתם של הילדים. תהליך קביעת המשמורת והסדרי הראייה מתבצע תוך התמקדות בטובת הילד, שהיא העיקרון המרכזי שמנחה את בתי המשפט. בין אם מדובר במשמורת מלאה, משמורת משותפת, או הסדרי ראייה ייחודיים, חשוב לדאוג שהסכמות אלה יוגדרו בצורה מפורטת וברורה, על מנת להבטיח יציבות בחיי הילד ושמירה על הקשר עם שני ההורים. עורכת דין מנוסה תסייע לכם להציג את עמדתכם בצורה מקצועית וממוקדת, ותדאג שהסדרי המשמורת והראייה יותאמו לצרכי המשפחה ולנסיבות החיים שלכם. בזכות ליווי משפטי איכותי, ניתן להגיע לפתרון שמאזן בין טובת הילד לבין זכויות ההורים, ומאפשר לכולם להתנהל בצורה מיטבית גם לאחר הפרידה.",
      image:"/child.png",

    },
    {
      title: "תביעות למזונות אישה וילדים",
      description:
        "תביעות למזונות אישה וילדים הן חלק בלתי נפרד מתהליכי גירושין, והן נועדו להבטיח את הצרכים הכלכליים של בני המשפחה במהלך ולאחר הפרידה. מזונות ילדים נקבעים בהתאם לגיל הילד, צרכיו, והכנסות ההורים, מתוך מטרה לספק לילד את רמת החיים שלה היה רגיל טרם הגירושין. מזונות אישה, לעומת זאת, נועדו לתמוך כלכלית באישה במקרים שבהם היא תלויה בבעל לפרנסתה. תהליך זה דורש הבנה מעמיקה של חוקי המזונות בישראל, ויכולת להציג הוכחות וראיות התומכות בדרישות הכספיות. בעזרת עורכת דין מקצועית, תוכלו להבטיח שההליך יתנהל בצורה מסודרת ומקצועית, וכי כל ההיבטים הכספיים יקבלו את המענה הנכון וההוגן ביותר. בנוסף, ניתן לשקול פתרונות מחוץ לכותלי בית המשפט, כמו הסדרים מוסכמים, שיכולים לחסוך זמן ומשאבים.",
      image:"/home.png",

    },
    {
      title: "צוואות וירושות",
      description:
        "תחום הצוואות והירושות נוגע להבטחת זכויותיהם של יורשים ולשמירה על רצונו של המוריש. עריכת צוואה היא הדרך הבטוחה ביותר לוודא שהנכסים שלכם יחולקו בהתאם לרצונכם לאחר לכתכם, תוך מניעת מחלוקות וסכסוכים משפחתיים. בנוסף לעריכת צוואות, אנו מתמחים בטיפול בסכסוכים ירושתיים, בקיום צוואות, ובניהול עיזבונות. תהליך זה מתבצע תוך שמירה על דיסקרטיות והבנה של המורכבויות המשפטיות והרגשיות הכרוכות בו. בעזרת עורכת דין מנוסה, תוכלו להבטיח שהליך הירושה יתנהל בצורה מסודרת ויעילה, וכי כל הצדדים המעורבים יזכו ליחס הוגן ולמענה מקצועי לצרכיהם.",
      image:"/home.png",

    },
  
        ].map((field, index) => (
            <div
            key={index}
            className={`expertise-item ${index % 2 === 0 ? "image-right" : "image-left"}`}
          >
            <div className="text-content">
              <h3>{field.title}</h3>
              <p>{field.description}</p>
            </div>
            <div className="image-content">
              <img src={field.image} className="img-item" alt={field.title} />
            </div>
          </div>
        ))}
      </section>
    </div>
  );
};

export default Services;